//===============================================
//タイトル制御[gameclear.cpp]
//Date:2023/09/05	Auther:林祐也
//===============================================
#include "gameclear.h"
#include "input.h"
#include "texture.h"
#include "sound.h"

//=============================================================================
// 初期化処理
//=============================================================================
GameClear::GameClear()
{
	SetTexture(LoadTexture((char*)"data/TEXTURE/GameClear.png"));//テクスチャのセット
	//SetSound(LoadSound((char*)"data/SOUND/BGM/BGM_GameClear.wav"));
	//SetVolume(GetSound(), 0.5f);//1.0が100％
	//PlaySound(GetSound(), 0);//後ろの数字で回数を決める、０以下になると無限ループになる
}

//=============================================================================
// 終了処理
//=============================================================================
GameClear::~GameClear()
{
	/*StopSound(GetSound());*/
	//UnloadTexture(GetTxture());
}

//=============================================================================
// 更新処理
//=============================================================================
void GameClear::Update()
{

}

//=============================================================================
// 描画処理
//=============================================================================
void GameClear::Draw(void)
{
	//DrawSpriteColorD3DX(GetTexture(), GetPos(), GetSize(),
	//	GetU(), GetV(), GetUW(), GetVH(),
	//	GetRed(), GetGreen(), GetBlue(), GetDegree());
}
